Stabl-Energy/ChibiOS/os/hal/ports/STM32/STM32F7xx/hal_efl_lld.c
/*
    Copyright (C) 2020 Thomas Elste
    ChibiOS - Copyright (C) 2006..2019 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    hal_efl_lld.c
 * @brief   STM32F7xx Embedded Flash subsystem low level driver source.
 *
 * @addtogroup HAL_EFL
 * @{
 */

#include <string.h>

#include "hal.h"

#if (HAL_USE_EFL == TRUE) || defined(__DOXYGEN__)

/*===========================================================================*/
/* Driver local definitions.                                                 */
/*===========================================================================*/

#define STM32_FLASH_LINE_SIZE               (1 << STM32_FLASH_PSIZE)
#define STM32_FLASH_LINE_MASK               (STM32_FLASH_LINE_SIZE - 1U)

#define FLASH_PDKEY1                        0x04152637U
#define FLASH_PDKEY2                        0xFAFBFCFDU

#define FLASH_KEY1                          0x45670123U
#define FLASH_KEY2                          0xCDEF89ABU

#define FLASH_OPTKEY1                       0x08192A3BU
#define FLASH_OPTKEY2                       0x4C5D6E7FU

#if !defined(FLASH_SR_OPERR)
#define FLASH_SR_OPERR                      FLASH_SR_SOP
#endif

/*===========================================================================*/
/* Driver exported variables.                                                */
/*===========================================================================*/

/**
 * @brief   EFL1 driver identifier.
 */
EFlashDriver EFLD1;

/*===========================================================================*/
/* Driver local variables and types.                                         */
/*===========================================================================*/

#if defined(STM32F767xx) || defined(STM32F769xx) ||                         \
    defined(STM32F777xx) || defined(STM32F779xx) ||                         \
    defined(STM32F765xx) || defined(__DOXYGEN__)

/* Sector table for 2M device, single bank. */
static const flash_sector_descriptor_t efl_lld_sect1_b1[STM32_FLASH1_B1_SECTORS_TOTAL] = {
  {         0,                        32768},   /* Sector  0. */
  { 1 * 32768,                        32768},   /* Sector  1. */
  { 2 * 32768,                        32768},   /* Sector  2. */
  { 3 * 32768,                        32768},   /* Sector  3. */
  { 4 * 32768,                       131072},   /* Sector  4. */
  { 4 * 32768 + 131072,              262144},   /* Sector  5. */
  { 4 * 32768 + 131072 + 1 * 262144, 262144},   /* Sector  6. */
  { 4 * 32768 + 131072 + 2 * 262144, 262144},   /* Sector  7. */
  { 4 * 32768 + 131072 + 3 * 262144, 262144},   /* Sector  8. */
  { 4 * 32768 + 131072 + 4 * 262144, 262144},   /* Sector  9. */
  { 4 * 32768 + 131072 + 5 * 262144, 262144},   /* Sector 10. */
  { 4 * 32768 + 131072 + 6 * 262144, 262144},   /* Sector 11. */
};

/* Sector table for 2M device, dual bank. */
static const flash_sector_descriptor_t efl_lld_sect1_b2[STM32_FLASH1_B2_SECTORS_TOTAL] = {
  {         0,                            16384},   /* Sector  0. */
  { 1 * 16384,                            16384},   /* Sector  1. */
  { 2 * 16384,                            16384},   /* Sector  2. */
  { 3 * 16384,                            16384},   /* Sector  3. */
  { 4 * 16384,                            65536},   /* Sector  4. */
  { 4 * 16384 + 1 * 65536,               131072},   /* Sector  5. */
  { 4 * 16384 + 1 * 65536 +  1 * 131072, 131072},   /* Sector  6. */
  { 4 * 16384 + 1 * 65536 +  2 * 131072, 131072},   /* Sector  7. */
  { 4 * 16384 + 1 * 65536 +  3 * 131072, 131072},   /* Sector  8. */
  { 4 * 16384 + 1 * 65536 +  4 * 131072, 131072},   /* Sector  9. */
  { 4 * 16384 + 1 * 65536 +  5 * 131072, 131072},   /* Sector 10. */
  { 4 * 16384 + 1 * 65536 +  6 * 131072, 131072},   /* Sector 11. */
  { 4 * 16384 + 1 * 65536 +  7 * 131072,  16384},   /* Sector 12. */
  { 5 * 16384 + 1 * 65536 +  7 * 131072,  16384},   /* Sector 13. */
  { 6 * 16384 + 1 * 65536 +  7 * 131072,  16384},   /* Sector 14. */
  { 7 * 16384 + 1 * 65536 +  7 * 131072,  16384},   /* Sector 15. */
  { 8 * 16384 + 1 * 65536 +  7 * 131072,  65536},   /* Sector 16. */
  { 8 * 16384 + 2 * 65536 +  7 * 131072, 131072},   /* Sector 17. */
  { 8 * 16384 + 2 * 65536 +  8 * 131072, 131072},   /* Sector 18. */
  { 8 * 16384 + 2 * 65536 +  9 * 131072, 131072},   /* Sector 19. */
  { 8 * 16384 + 2 * 65536 + 10 * 131072, 131072},   /* Sector 20. */
  { 8 * 16384 + 2 * 65536 + 11 * 131072, 131072},   /* Sector 21. */
  { 8 * 16384 + 2 * 65536 + 12 * 131072, 131072},   /* Sector 22. */
  { 8 * 16384 + 2 * 65536 + 13 * 131072, 131072},   /* Sector 23. */
};

/* Sector table for 1M device, single bank. */
static const flash_sector_descriptor_t efl_lld_sect2_b1[STM32_FLASH2_B1_SECTORS_TOTAL] = {
  {         0,                        32768},   /* Sector  0. */
  { 1 * 32768,                        32768},   /* Sector  1. */
  { 2 * 32768,                        32768},   /* Sector  2. */
  { 3 * 32768,                        32768},   /* Sector  3. */
  { 4 * 32768,                       131072},   /* Sector  4. */
  { 4 * 32768 + 131072,              262144},   /* Sector  5. */
  { 4 * 32768 + 131072 + 1 * 262144, 262144},   /* Sector  6. */
  { 4 * 32768 + 131072 + 2 * 262144, 262144},   /* Sector  7. */
};

/* Sector table for 1M device, dual bank */
static const flash_sector_descriptor_t efl_lld_sect2_b2[STM32_FLASH2_B2_SECTORS_TOTAL] = {
  {         0,                            16384},   /* Sector  0. */
  { 1 * 16384,                            16384},   /* Sector  1. */
  { 2 * 16384,                            16384},   /* Sector  2. */
  { 3 * 16384,                            16384},   /* Sector  3. */
  { 4 * 16384,                            65536},   /* Sector  4. */
  { 4 * 16384 + 1 * 65536,               131072},   /* Sector  5. */
  { 4 * 16384 + 1 * 65536 +  1 * 131072, 131072},   /* Sector  6. */
  { 4 * 16384 + 1 * 65536 +  2 * 131072, 131072},   /* Sector  7. */
  { 4 * 16384 + 1 * 65536 +  3 * 131072,  16384},   /* Sector 12. */
  { 5 * 16384 + 1 * 65536 +  3 * 131072,  16384},   /* Sector 13. */
  { 6 * 16384 + 1 * 65536 +  3 * 131072,  16384},   /* Sector 14. */
  { 7 * 16384 + 1 * 65536 +  3 * 131072,  16384},   /* Sector 15. */
  { 8 * 16384 + 1 * 65536 +  3 * 131072,  65536},   /* Sector 16. */
  { 8 * 16384 + 2 * 65536 +  3 * 131072, 131072},   /* Sector 17. */
  { 8 * 16384 + 2 * 65536 +  4 * 131072, 131072},   /* Sector 18. */
  { 8 * 16384 + 2 * 65536 +  5 * 131072, 131072},   /* Sector 19. */
};

#elif defined(STM32F756xx) || defined(STM32F746xx) ||                         \
      defined(STM32F745xx)

/* Sector table for 1M device, single bank. */
static const flash_sector_descriptor_t efl_lld_sect1_b1[STM32_FLASH1_B1_SECTORS_TOTAL] = {
  {         0,                        32768},   /* Sector  0. */
  { 1 * 32768,                        32768},   /* Sector  1. */
  { 2 * 32768,                        32768},   /* Sector  2. */
  { 3 * 32768,                        32768},   /* Sector  3. */
  { 4 * 32768,                       131072},   /* Sector  4. */
  { 4 * 32768 + 131072,              262144},   /* Sector  5. */
  { 4 * 32768 + 131072 + 1 * 262144, 262144},   /* Sector  6. */
  { 4 * 32768 + 131072 + 2 * 262144, 262144},   /* Sector  7. */
};

/* Sector table for 512k device, single bank. */
static const flash_sector_descriptor_t efl_lld_sect2_b1[STM32_FLASH2_B1_SECTORS_TOTAL] = {
  {         0,                        32768},   /* Sector  0. */
  { 1 * 32768,                        32768},   /* Sector  1. */
  { 2 * 32768,                        32768},   /* Sector  2. */
  { 3 * 32768,                        32768},   /* Sector  3. */
  { 4 * 32768,                       131072},   /* Sector  4. */
  { 4 * 32768 + 131072,              262144},   /* Sector  5. */
};

#elif defined(STM32F722xx) || defined(STM32F723xx) ||                         \
      defined(STM32F732xx) || defined(STM32F733xx)

/* Sector table for 512K device, single bank. */
static const flash_sector_descriptor_t efl_lld_sect1_b1[STM32_FLASH1_B1_SECTORS_TOTAL] = {
  {         0,                        16384},   /* Sector  0. */
  { 1 * 16384,                        16384},   /* Sector  1. */
  { 2 * 16384,                        16384},   /* Sector  2. */
  { 3 * 16384,                        16384},   /* Sector  3. */
  { 4 * 16384,                        65536},   /* Sector  4. */
  { 4 * 16384 + 65536,               131072},   /* Sector  5. */
  { 4 * 16384 + 65536 +  1 * 131072, 131072},   /* Sector  6. */
  { 4 * 16384 + 65536 +  2 * 131072, 131072},   /* Sector  7. */
};

/* Sector table for 256K device, single bank. */
static const flash_sector_descriptor_t efl_lld_sect2_b1[STM32_FLASH2_B1_SECTORS_TOTAL] = {
  {         0,                        16384},   /* Sector  0. */
  { 1 * 16384,                        16384},   /* Sector  1. */
  { 2 * 16384,                        16384},   /* Sector  2. */
  { 3 * 16384,                        16384},   /* Sector  3. */
  { 4 * 16384,                        65536},   /* Sector  4. */
  { 4 * 16384 + 65536,               131072},   /* Sector  5. */
};

#elif defined(STM32F730xx)

