Stabl-Energy/ChibiOS/os/hal/ports/STM32/STM32F7xx/hal_efl_lld.c
/* Sector table for 64K device, single bank. */
static const flash_sector_descriptor_t efl_lld_sect1_b1[STM32_FLASH1_B1_SECTORS_TOTAL] = {
  {         0,                        16384},   /* Sector  0. */
  { 1 * 16384,                        16384},   /* Sector  1. */
  { 2 * 16384,                        16384},   /* Sector  2. */
  { 3 * 16384,                        16384},   /* Sector  3. */
};

#elif defined(STM32F750xx)

/* Sector table for 64K device, single bank. */
static const flash_sector_descriptor_t efl_lld_sect1_b1[STM32_FLASH1_B1_SECTORS_TOTAL] = {
  {         0,                        32768},   /* Sector  0. */
  { 1 * 32768,                        32768},   /* Sector  1. */
};

#else
#error "This EFL driver does not support the selected device"
#endif

static const flash_descriptor_t efl_lld_size1[STM32_FLASH_NUMBER_OF_BANKS] = {
      { /* Single bank organisation. */
       .attributes        = FLASH_ATTR_ERASED_IS_ONE |
                            FLASH_ATTR_MEMORY_MAPPED,
       .page_size         = STM32_FLASH_LINE_SIZE,
       .sectors_count     = STM32_FLASH1_B1_SECTORS_TOTAL,
       .sectors           = efl_lld_sect1_b1,
       .sectors_size      = 0,
       .address           = (uint8_t *)FLASH_BASE,
       .size              = STM32_FLASH1_SIZE * STM32_FLASH_SIZE_SCALE
      },
#if STM32_FLASH_NUMBER_OF_BANKS > 1
      { /* Dual bank organisation. */
       .attributes        = FLASH_ATTR_ERASED_IS_ONE |
                            FLASH_ATTR_MEMORY_MAPPED,
       .page_size         = STM32_FLASH_LINE_SIZE,
       .sectors_count     = STM32_FLASH1_B2_SECTORS_TOTAL,
       .sectors           = efl_lld_sect1_b2,
       .sectors_size      = 0,
       .address           = (uint8_t *)FLASH_BASE,
       .size              = STM32_FLASH1_SIZE * STM32_FLASH_SIZE_SCALE
      }
#endif
};

#ifdef STM32_FLASH2_SIZE
static const flash_descriptor_t efl_lld_size2[STM32_FLASH_NUMBER_OF_BANKS] = {
      { /* Single bank organisation. */
       .attributes        = FLASH_ATTR_ERASED_IS_ONE |
                            FLASH_ATTR_MEMORY_MAPPED,
       .page_size         = STM32_FLASH_LINE_SIZE,
       .sectors_count     = STM32_FLASH2_B1_SECTORS_TOTAL,
       .sectors           = efl_lld_sect2_b1,
       .sectors_size      = 0,
       .address           = (uint8_t *)FLASH_BASE,
       .size              = STM32_FLASH2_SIZE * STM32_FLASH_SIZE_SCALE
      },
#if STM32_FLASH_NUMBER_OF_BANKS > 1
      { /* Dual bank organisation. */
       .attributes        = FLASH_ATTR_ERASED_IS_ONE |
                            FLASH_ATTR_MEMORY_MAPPED,
       .page_size         = STM32_FLASH_LINE_SIZE,
       .sectors_count     = STM32_FLASH2_B2_SECTORS_TOTAL,
       .sectors           = efl_lld_sect2_b2,
       .sectors_size      = 0,
       .address           = (uint8_t *)FLASH_BASE,
       .size              = STM32_FLASH2_SIZE * STM32_FLASH_SIZE_SCALE
      }
#endif
};
#endif

/* Table describing possible flash sizes and descriptors for this device. */
static const efl_lld_size_t efl_lld_flash_sizes[] = {
      {
       .desc = efl_lld_size1
      },
#ifdef STM32_FLASH2_SIZE
      {
       .desc = efl_lld_size2
      }
#endif
};

/*===========================================================================*/
/* Driver local functions.                                                   */
/*===========================================================================*/

static inline void stm32_flash_lock(EFlashDriver *eflp) {

  eflp->flash->CR |= FLASH_CR_LOCK;
}

static inline void stm32_flash_unlock(EFlashDriver *eflp) {

  eflp->flash->KEYR |= FLASH_KEY1;
  eflp->flash->KEYR |= FLASH_KEY2;
}

static inline void stm32_flash_enable_pgm(EFlashDriver *eflp) {

  /* Set parallelism. */
  eflp->flash->CR &= ~FLASH_CR_PSIZE;
  eflp->flash->CR |= STM32_FLASH_PSIZE << FLASH_CR_PSIZE_Pos;

  /* Enable programming. */
  eflp->flash->CR |= FLASH_CR_PG;
}

static inline void stm32_flash_disable_pgm(EFlashDriver *eflp) {

  eflp->flash->CR &= ~FLASH_CR_PG;
}

static inline void stm32_flash_clear_status(EFlashDriver *eflp) {

  eflp->flash->SR = 0x0000FFFFU;
}

static inline void stm32_flash_wait_busy(EFlashDriver *eflp) {

  /* Wait for busy bit clear.*/
  while ((eflp->flash->SR & FLASH_SR_BSY) != 0U) {
  }
}

static inline size_t stm32_flash_get_size(void) {
  return *(uint16_t*)((uint32_t) STM32_FLASH_SIZE_REGISTER) * STM32_FLASH_SIZE_SCALE;
}

static inline bool stm32_flash_dual_bank(EFlashDriver *eflp) {

#if STM32_FLASH_NUMBER_OF_BANKS > 1
  return ((eflp->flash->OPTCR & FLASH_OPTCR_nDBANK) == 0U);
#endif
  (void)eflp;
  return false;
}

static inline flash_error_t stm32_flash_check_errors(EFlashDriver *eflp) {
  uint32_t sr = eflp->flash->SR;

  /* Clearing error conditions.*/
  eflp->flash->SR = sr & 0x0000FFFFU;

  /* Some errors are only caught by assertion.*/
  osalDbgAssert((sr & 0) == 0U, "unexpected flash error");

  /* Decoding relevant errors.*/
  if ((sr & FLASH_SR_WRPERR) != 0U) {
    return FLASH_ERROR_HW_FAILURE;
  }

  if ((sr & (FLASH_SR_PGAERR | FLASH_SR_PGPERR | FLASH_SR_OPERR)) != 0U) {
    return eflp->state == FLASH_PGM ? FLASH_ERROR_PROGRAM : FLASH_ERROR_ERASE;
  }

  return FLASH_NO_ERROR;
}

/*===========================================================================*/
/* Driver interrupt handlers.                                                */
/*===========================================================================*/

/*===========================================================================*/
/* Driver exported functions.                                                */
/*===========================================================================*/


/**
 * @brief   Low level Embedded Flash driver initialization.
 *
 * @notapi
 */
void efl_lld_init(void) {

  /* Driver initialization.*/
  eflObjectInit(&EFLD1);
  EFLD1.flash = FLASH;
  /* Find the size of the flash and set descriptor reference. */
  uint8_t i;

  for (i = 0; i < (sizeof(efl_lld_flash_sizes) / sizeof(efl_lld_size_t)); i++) {
    if (efl_lld_flash_sizes[i].desc->size == stm32_flash_get_size()) {
      EFLD1.descriptor = efl_lld_flash_sizes[i].desc;
      if (stm32_flash_dual_bank(&EFLD1)) {
        /* Point to the dual bank descriptor. */
        EFLD1.descriptor++;
      }
      return;
    }
  }
  osalDbgAssert(false, "invalid flash configuration");
}

/**
 * @brief   Configures and activates the Embedded Flash peripheral.
 *
 * @param[in] eflp      pointer to a @p EFlashDriver structure
 *
 * @notapi
 */
void efl_lld_start(EFlashDriver *eflp) {

